***PANDAS***

it is an opensource library that allows to perform data manipulation in python

In [3]:
import pandas as pd

**DATA STRUCTURES IN PANDAS:**

--SERIES= 1-d data structure.contains only one value and does not include column name.

--DATA FRAMES= multi dimensional data. contains values with column name.

SERIES:

syntax=pd.Series(name)

In [13]:
a=pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
type(a)

pandas.core.series.Series

***DATAFRAME***::

in dataframe values length should be equeal.

it is mutable.

syntax=pd.DataFrame(name)

--df.head(no.of data linees) gives top data in dataframe.

--df.tail() gives bottom data in dataframe.

--df.sample(index)gives us randomly indexed data.

--df.shape gives total data shape.

--df.columns gives us total columns of data frame.

--df.info() gives overall information of dataframe like memory used,data types,etc

--df.describe() gives statiscally view of dataframe.

--df['columnname'].value_counts() gives us total number of sub categories in a column

we can make changes in a dataframe.

--df['column'][row no.]='value to be changed'

--df.loc[row_range(start,end),column_name]= helps us extract data

--df.iloc[row_range(start,end+1),column_range]

In [22]:
b={
    'Name':['Tanisha','Ayush','Megha','Avi','Jay'],
    'Age':[20,30,40,24,23],
    'Salary':[10000,20000,30000,4000,5000],
    'City':['Delhi','Mumbai','Pune','indore','jaipur']

}
df=pd.DataFrame(b)
df

      Name  Age  Salary    City
0  Tanisha   20   10000   Delhi
1    Ayush   30   20000  Mumbai
2    Megha   40   30000    Pune
3      Avi   24    4000  indore
4      Jay   23    5000  jaipur

In [27]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df.head(2)

      Name  Age  Salary    City
0  Tanisha   20   10000   Delhi
1    Ayush   30   20000  Mumbai

In [31]:
df.tail(1)

  Name  Age  Salary    City
4  Jay   23    5000  jaipur

In [33]:
df.sample(2)

      Name  Age  Salary   City
0  Tanisha   20   10000  Delhi
2    Megha   40   30000   Pune

In [39]:
df.shape

(5, 4)

In [41]:
df.columns

Index(['Name', 'Age', 'Salary', 'City'], dtype='object')

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
 3   City    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [49]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   27.400000  13800.000000
std     7.924645  11054.410884
min    20.000000   4000.000000
25%    23.000000   5000.000000
50%    24.000000  10000.000000
75%    30.000000  20000.000000
max    40.000000  30000.000000

In [51]:
df['Age'].value_counts()

Age
20    1
30    1
40    1
24    1
23    1
Name: count, dtype: int64

In [57]:
df['Name'][2]='Tanu'
df

C:\Users\VICTUS\AppData\Local\Temp\ipykernel_59804\3782330275.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Name'][2]='Tanu'
C:\Users\VICTUS\AppData\Local\Temp\ipykernel_59804\3782330275.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]='Tanu'

      Name  Age  Salary    City
0  Tanisha   20   10000   Delhi
1    Ayush   30   20000  Mumbai
2     Tanu   40   30000    Pune
3      Avi   24    4000  indore
4      Jay   23    5000  jaipur

In [59]:
df.loc[1:3,['Name','Salary']]

    Name  Salary
1  Ayush   20000
2   Tanu   30000
3    Avi    4000

In [61]:
df.iloc[1:3,[0,1,2]]

    Name  Age  Salary
1  Ayush   30   20000
2   Tanu   40   30000